/* float_int_run Бегуны
Два бегуна бегают по круговой гаревой дорожке. Тренировку они начали одновременно.
Первый бегун пробежал всего 0 < n < 1000 кругов.
Первый бегун бежит со скоростью  v, второй со скоростью kv, где  0 < k <= 1.
Сколько раз бегуны встретились за время тренировки на дорожке?
Дано: целое число n (количество кругов, которые пробежал первый бегун) и, через пробел, 
    дробное число k (отношение скорости первого бегуна к скорости второго бегуна).
Найти: целое число - количество встреч.
Sample Input: 2 0.5
Sample Output: 1
*/
#include <stdio.h>

int main() {
    int n = 0, day = 0;
    scanf("%d%d", &n, &day);

    printf("%d", 0);
    
    return 0;
}