/* Сколько стоит обед?
У студента есть n рублей.

Он хочет купить на обед в столовой 1 порцию риса за k_rice рублей и 2 салата за k_veg рублей каждый.

Дано: n k_rice k_veg через пробел на одной строке. Все числа целые.

Напечатайте:

Входные данные n k_rice k_veg через пробел на первой строке,
Вычислите и напечатайте, сколько стоит обед на второй строке.
Напечатайте YES, если студенту хватит денег на обед, на третьей строке.
Дано: n k_rice k_veg через пробел на одной строке.
Sample Input:

100 15 30
Sample Output:

100 15 30
75
YES
*/
